      *================================================================*
       IDENTIFICATION                                  DIVISION.
      *================================================================*
       PROGRAM-ID. "Comandos decisao".
       AUTHOR. "LUCAS KURATA".
      *================================================================*
       ENVIRONMENT                                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                          SECTION.
      *-----------------------------------------------------------------

       SPECIAL-NAMES.


      *-----------------------------------------------------------------
       INPUT-OUTPUT                           SECTION.
      *=================================================================

      *=================================================================
      *-----------------------------------------------------------------
       FILE-CONTROL.
      *=================================================================
       DATA                                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       FILE                                   SECTION.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
       WORKING-STORAGE                     SECTION.
       77  WRK-NUMERO                      PIC X(10) VALUE SPACES.

       77  WRK-NUMERO2                     PIC X(10) VALUE SPACES.

       77  WRK-TELEFONE                    PIC 9(10) VALUE 27422216.

      *-----------------------------------------------------------------
      *=================================================================
       PROCEDURE                                       DIVISION.
      *=================================================================
           DISPLAY 'DIGITE O PRIMEIRO NUMERO'
           ACCEPT WRK-NUMERO.
           DISPLAY 'DIGITE O SEGUNDO NUMERO'
           ACCEPT WRK-NUMERO2
           IF WRK-NUMERO GREATER THAN WRK-NUMERO2
               DISPLAY WRK-NUMERO ' EH MAIOR QUE ' WRK-NUMERO2
           ELSE
               DISPLAY WRK-NUMERO2 ' EH MAIOR QUE ' WRK-NUMERO
           END-IF.

           IF WRK-TELEFONE NOT EQUAL ZEROS
               DISPLAY 'LIGANDO PARA A PESSOA'
           END-IF

           STOP RUN.
