      *================================================================*
       IDENTIFICATION                                  DIVISION.
      *================================================================*
       PROGRAM-ID. "Comandos basicos".
       AUTHOR. "LUCAS KURATA".
      *================================================================*
       ENVIRONMENT                                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                          SECTION.
      *-----------------------------------------------------------------

       SPECIAL-NAMES.


      *-----------------------------------------------------------------
       INPUT-OUTPUT                           SECTION.
      *=================================================================

      *=================================================================
      *-----------------------------------------------------------------
       FILE-CONTROL.
      *=================================================================
       DATA                                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       FILE                                   SECTION.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
       WORKING-STORAGE                     SECTION.
       77  WRK-NOMES                           PIC X(12) VALUE SPACES.

       77  WRK-DATA                            PIC 9(6) VALUE ZEROS.

       77  WRK-TELEFONE                        PIC 9(9) VALUE 975591454.

       77  WRK-COPIA_TELEFONE                  PIC 9(9).

       77  WRK-SENHA                           PIC 9(8) VALUE 27455518.
      *-----------------------------------------------------------------
      *=================================================================
       PROCEDURE                                       DIVISION.
      *=================================================================
           ACCEPT WRK-NOMES
           DISPLAY WRK-NOMES.

           ACCEPT WRK-DATA FROM DATE
           DISPLAY WRK-DATA.

           MOVE 27422216 TO WRK-SENHA
           DISPLAY WRK-SENHA.

           MOVE WRK-TELEFONE TO WRK-COPIA_TELEFONE
           DISPLAY 'Copia do WRK-TELEFONE ' WRK-COPIA_TELEFONE.

           STOP RUN.
